Lockless CAS Optimization/results/benchmark_results/ordered_opt0_t16_r1_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     3691.77
    fsyncs/s:                     3691.77

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               57.68

General statistics:
    total time:                          10.0030s
    total number of events:              36936

Latency (ms):
         min:                                    1.79
         avg:                                    4.33
         max:                                   14.82
         95th percentile:                        4.82
         sum:                               159770.01

Threads fairness:
    events (avg/stddev):           2308.5000/2.52
    execution time (avg/stddev):   9.9856/0.00