Lockless CAS Optimization/results/benchmark_results/ordered_opt0_t16_r3_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     2621.28
    fsyncs/s:                     2621.28

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               40.96

General statistics:
    total time:                          10.0024s
    total number of events:              26224

Latency (ms):
         min:                                    1.66
         avg:                                    6.09
         max:                                  203.79
         95th percentile:                        4.82
         sum:                               159834.92

Threads fairness:
    events (avg/stddev):           1639.0000/1.87
    execution time (avg/stddev):   9.9897/0.00