Lockless CAS Optimization/results/benchmark_results/ordered_opt1_t16_r2_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     3706.16
    fsyncs/s:                     3706.16

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               57.91

General statistics:
    total time:                          10.0037s
    total number of events:              37083

Latency (ms):
         min:                                    1.71
         avg:                                    4.31
         max:                                   12.63
         95th percentile:                        4.82
         sum:                               159790.97

Threads fairness:
    events (avg/stddev):           2317.6875/3.12
    execution time (avg/stddev):   9.9869/0.00