Lockless CAS Optimization/results/benchmark_results/ordered_opt1_t8_r2_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     1993.08
    fsyncs/s:                     1993.08

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               31.14

General statistics:
    total time:                          10.0018s
    total number of events:              19939

Latency (ms):
         min:                                    1.81
         avg:                                    4.00
         max:                                   12.25
         95th percentile:                        4.49
         sum:                                79847.18

Threads fairness:
    events (avg/stddev):           2492.3750/0.99
    execution time (avg/stddev):   9.9809/0.00