Lockless CAS Optimization/results/benchmark_results/writeback_opt0_t16_r2_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     3209.14
    fsyncs/s:                     3209.14

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               50.14

General statistics:
    total time:                          10.0036s
    total number of events:              32109

Latency (ms):
         min:                                    1.67
         avg:                                    4.98
         max:                                  194.67
         95th percentile:                        4.74
         sum:                               159819.49

Threads fairness:
    events (avg/stddev):           2006.8125/3.81
    execution time (avg/stddev):   9.9887/0.00