Lockless CAS Optimization/results/benchmark_results/writeback_opt0_t16_r3_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     1511.90
    fsyncs/s:                     1511.90

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               23.62

General statistics:
    total time:                          10.0032s
    total number of events:              15126

Latency (ms):
         min:                                    1.81
         avg:                                   10.57
         max:                                  205.81
         95th percentile:                        5.18
         sum:                               159927.51

Threads fairness:
    events (avg/stddev):           945.3750/1.87
    execution time (avg/stddev):   9.9955/0.00