Lockless CAS Optimization/results/benchmark_results/writeback_opt1_t16_r1_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     2375.59
    fsyncs/s:                     2375.59

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               37.12

General statistics:
    total time:                          10.0024s
    total number of events:              23766

Latency (ms):
         min:                                    1.67
         avg:                                    6.73
         max:                                  198.31
         95th percentile:                        4.82
         sum:                               159854.64

Threads fairness:
    events (avg/stddev):           1485.3750/1.69
    execution time (avg/stddev):   9.9909/0.00