Lockless CAS Optimization/results/benchmark_results/writeback_opt1_t4_r3_sysbench.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32KiB each
4MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     921.28
    fsyncs/s:                     921.28

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               14.39

General statistics:
    total time:                          10.0035s
    total number of events:              9218

Latency (ms):
         min:                                    1.80
         avg:                                    4.33
         max:                                   85.93
         95th percentile:                        4.57
         sum:                                39939.68

Threads fairness:
    events (avg/stddev):           2304.5000/0.50
    execution time (avg/stddev):   9.9849/0.00